Public Attributes | List of all members
API_PlaceInfo Struct Reference
Geolocation
The current location, date and sun parameters. More...
#include <APIdefs_Environment.h>
 Public Attributes
 bool  | sumTime
true if daylight saving time is in effect
 unsigned short  | year
The year at the given place.
 unsigned short  | month
The month at the given place.
 unsigned short  | day
The day at the given place.
 unsigned short  | hour
The hour at the given place.
 unsigned short  | minute
The minute at the given place.
 unsigned short  | second
The second at the given place.
 double  | longitude
longitude in degrees
 double  | latitude
latitude in degrees
 double  | altitude
altitude in meters
 double  | north
North direction in radians.
 double  | sunAngXY
Sun position component in radians.
 double  | sunAngZ
Sun position component in radians.
 API_NorthUnitID  | northUnit
angle unit of north direction. See also: API_NorthUnitID
 API_AltitudeUnitID  | altitudeUnit
display altitude in meters or feet. See also: API_AltitudeUnitID
 API_LongLatUnitID  | longLatUnit
display latLongUnit in decimal degrees or degrees, minutes and seconds. See also: API_LongLatUnitID
 short  | timeZoneInMinutes
Time zone in minutes from Greenwich.
 short  | timeZoneOffset
Used when different timezones have the same timeZoneInMinutes.
Detailed Description
The current location, date and sun parameters.
Since
Archicad 26
Remarks
This structure is used to hold the consistent location, date and sun parameters. It can be used either to retrieve the current parameter set (see the ACAPI_GeoLocation_GetPlaceSets function); or to calculate the sun angles in a given place at a given time (see the ACAPI_GeoLocation_CalcSunOnPlace function); or to set/change and the current parameter set (see ACAPI_GeoLocation_ChangePlaceSets function).